app/views/feeds/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."feed_id" = ?  [["feed_id", 1]]
---

					<%= link_to pluralize(f.comments.count, 'comment'), f, class: "btn btn-primary btn-xs" %>