app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
				<h4>"<%=link_to c.body, Feed.find(c.feed_id) %>"<h4>
				<i class="fa fa-chevron-circle-right"></i> <%= link_to Feed.find(c.feed_id).user.username.capitalize, users_show_path(Feed.find(c.feed_id).user_id) %> :