app/controllers/comments_controller.rb

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "feed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello Hello"], ["feed_id", 1], ["created_at", "2015-05-07 11:16:33.263042"], ["updated_at", "2015-05-07 11:16:33.263042"]]
UPDATE "comments" SET "commenter" = ?, "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["commenter", "Ganesh"], ["user_id", 3], ["updated_at", "2015-05-07 11:16:33.266012"], ["id", 1]]
---
	def create
		@feed = Feed.find(params[:feed_id])
		@comment = @feed.comments.create(comment_params)
		@comment.commenter = current_user.username
		@comment.user_id = current_user.id


		if @comment.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "comments".* FROM "comments" WHERE "comments"."feed_id" = ? AND "comments"."id" = ? LIMIT 1  [["feed_id", 13], ["id", 7]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]
---
	def destroy
		@feed = Feed.find(params[:feed_id])
		@comment = @feed.comments.find(params[:id])
		@comment.destroy