app/controllers/feeds_controller.rb

	def index
		@feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

	def create
		@feed = current_user.feeds.build(feed_params)
		@feed.name = current_user.username
		respond_to do |format|
      if @feed.save
---
INSERT INTO "feeds" ("text", "user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Hello !"], ["user_id", 1], ["name", "Nirajan"], ["created_at", "2015-05-07 11:16:03.408521"], ["updated_at", "2015-05-07 11:16:03.408521"]]

	def edit
		@feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 2]]

	def show
		@feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		@feed = Feed.find(params[:id])
		@feed.destroy
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 6]]

	def upvote
		@feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 1]]

	def downvote
		@feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 1]]