app/controllers/users_controller.rb

  def show
  @user = User.find(:id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]